<?php

use reviewer\models\Vacancy;

return [
    'mongo' => [
            'connection' => [
                'hostnames' => 'mongodb',
                'database'  => $_SERVER['COMMON_MONGO_DATABASE'],
                'username'  => $_SERVER['COMMON_MONGO_USERNAME'],
                'password'  => $_SERVER['COMMON_MONGO_PASSWORD'],
                'options' => [],
            ],
    ],
    'censor' => [
        'stopWords' => [
        ],
        'goodWords' => [
            'ОПЛАЧИВАТЬСЯ', 'РАБОТАТЬ', 'ОФИС', 'ТРЕБОВАНИЕ', 'РАБОТА', 'ГРАФИК', 'ОПЫТ', 'ИСКАТЬ', 'ТРЕБОВАТЬСЯ',
            'СРОК', 'ПИСАТЬ', 'УДАЛЕНКА', 'СОБЕСЕДОВАНИЕ', 'РЕЗЮМЕ', 'ШТАТ', 'УМЕТЬ', 'ХОТЕТЬ', 'ПРЕДЛОЖИТЬ', 'КОЛЛЕГА'
        ],
    ],
    'categoryDefaultWeight' => 0.34,
    'categoryWords' => [
        Vacancy::CATEGORY_DESIGNER => [
            'ДИЗАЙНЕР' => 1, 'ФОТО', 'PHOTOSHOP', 'ILLUSTRATOR', 'INDESIGN', 'МАКЕТ', 'ИЛЛЮСТРАТОР' => 1, 'ИНДИЗАЙН',
            'ТИПОГРАФИЯ', 'ПЕЧАТЬ', 'ВИЗУАЛИЗАЦИЯ', 'АНИМАЦИЯ', 'ОФОРМЛЕНИЕ', 'ПОРТФОЛИО', 'МОУШНДИЗАЙНЕР',
            'ВЕБДИЗАЙНЕР', 'КЛЮЧ', 'РЕКЛАМА', 'БАННЕР', 'ПОЛИГРАФИЯ', 'РИСОВАНИЕ', 'ВЕКТОР', 'ОТРИСОВАТЬ', 'ЛОГО',
            'СТИЛЬ', 'ЦВЕТ', 'ШАБЛОН', 'ЛОГО', 'НАРИСОВАТЬ', 'ДИЗАЙН'
        ],
        Vacancy::CATEGORY_FRONTEND => [
            'ВЕРСТАЛЬЩИК' => 1, 'HTML', 'CSS', 'JQUERY', 'КРОССБРАУЗЕРНОСТЬ', 'ВЕРСТКА', 'ШАБЛОН', 'НАТЯНУТЬ'
        ],
        Vacancy::CATEGORY_PROGRAMMER => [
            'ПРОГРАММИСТ' => 1, 'PHP', 'JAVASCRIPT', 'JAVA', 'РАЗРАБОТКА', 'РАЗРАБАТЫВАТЬ', 'КОД', 'ООП', 'РАЗРАБОТЧИК' => 1,
            'ПРОГРАММИРОВАНИЕ', 'ПРОГРАММА',
        ],
        Vacancy::CATEGORY_WEBMASTER => [
            'АДМИН' => 1, 'САЙТ', 'ПЛАТФОРМА', 'НАСТРОИТЬ', 'ПРАВКА', 'СИСТЕМА', 'ШАБЛОН'
        ],
    ],
];